packages/artillery-plugin-expect/test/pets-fail-test.yaml
config:
  target: http://localhost:9090
  phases:
    - duration: 1
      arrivalCount: 1
  plugins:
    expect:
      reportFailuresAsErrors: true
      useRequestNames: true
scenarios:
  - flow:
      - get:
          name: 'unicorns'
          url: '/pets/2'
          expect:
            - statusCode: 200