packages/artillery-plugin-expect/test/pets-test.yaml
config:
  target: http://localhost:9090
  phases:
    - duration: 1
      arrivalCount: 1
  plugins:
    expect: {}
  payload:
    - path: "./urls.csv"
      fields:
        - url
        - statusCode
  ensure:
    maxErrorRate: 0
scenarios:
  - flow:
      - get:
          name: "List all pets"
          url: "/pets"
          expect:
            - contentType: json
            - statusCode: 200
            - hasProperty: result
            - matchesRegexp: .+
      - post:
          name: "Create a pet"
          url: "/pets"
          json:
            name: Tiki
            species: pony
          expect:
            statusCode:
              - 301
              - 202
      - get:
          name: "Get a pet"
          url: "/pets/1"
          capture:
            - json: "$.result.0.name"
              as: "name"
          expect:
            statusCode: 200
            contentType: json
            equals:
              - "{{ name }}"
              - "Luna"
      - get:
          name: "Get a non-existent pet"
          url: "/pets/2"
          expect:
            - statusCode: 404
            - contentType: json
            - hasProperty: status
            - hasProperty: type
            - hasProperty: title
            - hasProperty: detail
      - get:
          name: "CSV-driven expectation"
          url: "{{ url }}"
          expect:
            statusCode: "{{ statusCode }}"
      - get:
          name: "Get a user"
          url: "/users/1"
          capture:
            - json: $.user
              as: uid
          expect:
            equals:
              - "{{ uid }}"
              - "banana"